---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentSharedFamily
source: html/1b044c80-e60b-3495-2960-5c14a172097d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.NotBentSharedFamily Property

While making curved beam type "[Type Name]" Shared Family Instances were not created

## Syntax (C#)
```csharp
public static FailureDefinitionId NotBentSharedFamily { get; }
```